tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kreuzwerker/taps"
tap "mongodb/brew"
tap "universal-ctags/universal-ctags"
brew "aws-iam-authenticator"
brew "python@3.11"
brew "docutils"
brew "awscli"
brew "python@3.10"
brew "chart-testing"
brew "coreutils"
brew "fzf"
brew "git-delta"
brew "grep"
brew "hadolint"
brew "helm"
brew "htop"
brew "jq"
brew "jsonschema"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "libidn2"
brew "mitmproxy"
brew "nnn"
brew "packer"
brew "virtualenv"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "tfenv"
brew "tldr"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "hashicorp/tap/terraform-ls"
brew "mongodb/brew/mongodb-database-tools"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "cheatsheet"
cask "google-drive"
cask "iterm2"
cask "kap"
cask "keepassxc"
cask "maccy"
cask "messenger"
cask "mongodb-compass"
cask "postman"
cask "rectangle"
cask "slack"
cask "telegram"
cask "vlc"
