tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "universal-ctags/universal-ctags"
tap "weaveworks/tap"
# C++ Common Libraries
brew "abseil"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# High performance key/value database
brew "berkeley-db"
# Vector graphics library with cross-device output support
brew "cairo"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Git Remote Helper to interact with AWS CodeCommit
brew "git-remote-codecommit"
# GNU triangulated surface library
brew "gts"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Easy way to access the system keyring service from python
brew "keyring"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# HTTP/2 C Library
brew "libnghttp2"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Trigger notifications when a process completes
brew "noti"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Two-factor authentication software
cask "authy"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# Password manager app
cask "keepassxc"
# Clipboard manager
cask "maccy"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
